# YOLOv12 dual-stream P2 fair ablation F3
# plainP2 + C3k2@P4 + no P3 aux.
# NOTE: P3 aux is controlled by train.py, not by YAML. Run with --disable_aux_head.

nc: 3
ch: 6
dual_stream: true

cmg_stages: []
cma_stages: []
p2_fusion: plain

scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]

backbone:
  - [-1, 1, Conv,   [64, 3, 2]]
  - [-1, 1, Conv,   [128, 3, 2, 1, 2]]
  - [-1, 2, C3k2,   [256, False, 0.25]]
  - [-1, 1, Conv,   [256, 3, 2, 1, 4]]
  - [-1, 2, C3k2,   [512, False, 0.25]]
  - [-1, 1, Conv,   [512, 3, 2]]
  - [-1, 4, C3k2,   [512, True]]
  - [-1, 1, Conv,   [1024, 3, 2]]
  - [-1, 4, A2C2f,  [1024, True, 1]]

head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]]
  - [-1, 2, A2C2f, [512, False, -1]]

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]]
  - [-1, 2, A2C2f, [256, False, -1]]

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 2], 1, Concat, [1]]
  - [-1, 2, C3k2, [128, False, 0.25]]

  - [-1, 1, Conv, [128, 3, 2]]
  - [[-1, 14], 1, Concat, [1]]
  - [-1, 2, A2C2f, [256, False, -1]]

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 11], 1, Concat, [1]]
  - [-1, 2, A2C2f, [512, False, -1]]

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 8], 1, Concat, [1]]
  - [-1, 2, C3k2, [1024, True]]

  - [[17, 20, 23, 26], 1, Detect, [nc]]
