# YOLOv12-MF: Dual-Stream RGB-IR Mid-Fusion (ADR-001, Option B)
# 双分支中期融合检测模型，每分支独立处理 3 通道，P3/P4/P5 融合后共享 neck+head

# Parameters
nc: 3           # smoke, fire, person
ch: 6           # 数据管线输出 6 通道，DualStreamDetectionModel 内部各分支用 3 通道
dual_stream: true

# cmg_stages: 哪些层级做 CrossModalGating
#   Exp-1 concat-only (无 CMG):    cmg_stages: []
#   Exp-2 对称 + CMG@P4P5:        cmg_stages: [p4, p5]
#   Exp-4 对称 + CMG@P3P4P5:      cmg_stages: [p3, p4, p5]
cmg_stages: [p4, p5]  # Exp-2: CMG@P4P5（SE 通道门控，IR 引导 RGB，RGB 引导 IR）
cma_stages: [p4, p5]  # Exp-4a: CrossModalA2C2f@P4P5（RGB 分支 Q=RGB KV=IR，IR 分支保持自注意力）

scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]

# 单分支 backbone 结构（会被复制为 RGB 和 IR 两个分支）
# 与 yolov12.yaml backbone 完全一致（P3/P4/P5 融合点：层 4, 6, 8）
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv,   [64, 3, 2]]           # 0-P1/2
  - [-1, 1, Conv,   [128, 3, 2, 1, 2]]    # 1-P2/4
  - [-1, 2, C3k2,   [256, False, 0.25]]   # 2
  - [-1, 1, Conv,   [256, 3, 2, 1, 4]]    # 3-P3/8
  - [-1, 2, C3k2,   [512, False, 0.25]]   # 4 ← P3 融合点
  - [-1, 1, Conv,   [512, 3, 2]]          # 5-P4/16
  - [-1, 4, A2C2f,  [512, True, 4]]       # 6 ← P4 融合点
  - [-1, 1, Conv,   [1024, 3, 2]]         # 7-P5/32
  - [-1, 4, A2C2f,  [1024, True, 1]]      # 8 ← P5 融合点

# 共享 neck + head（与 yolov12.yaml head 完全一致）
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]]             # cat backbone P4
  - [-1, 2, A2C2f, [512, False, -1]]      # 11

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]]             # cat backbone P3
  - [-1, 2, A2C2f, [256, False, -1]]      # 14

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 11], 1, Concat, [1]]            # cat head P4
  - [-1, 2, A2C2f, [512, False, -1]]      # 17

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 8], 1, Concat, [1]]             # cat head P5
  - [-1, 2, C3k2, [1024, True]]           # 20

  - [[14, 17, 20], 1, Detect, [nc]]       # Detect(P3, P4, P5)
